#Область ПрограммныйИнтерфейс

// Выводит элементы на форму
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо добавить элементы
Процедура ПриСозданииФормыНаСервере(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы; 
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеВвода(Форма, "КонтактноеЛицо", "Объект.Д_КонтактноеЛицо", Форма.Элементы.Найти("ГруппаШапкаПраво"));

	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеВвода(Форма, "КонтактноеЛицо", "Объект.Д_КонтактноеЛицо", Форма.Элементы.Найти("ГруппаШапкаПраво"));
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеВвода(Форма, "КонтактноеЛицо", "Объект.Д_КонтактноеЛицо", Форма.Элементы.Найти("ГруппаШапкаПраво"));
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеВвода(Форма, "КонтактноеЛицо", "Объект.Д_КонтактноеЛицо", , Форма.Элементы.Найти("Основание"));
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеВвода(Форма, "КонтактноеЛицо", "Объект.Д_КонтактноеЛицо", , Форма.Элементы.Найти("СуммаДокумента"));
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьПолеВвода(Форма, ИмяПоля, ПутьКДанным, Родитель = Неопределено, ПоместитьПеред = Неопределено)

	НовыйЭлемент = Форма.Элементы.Найти(ИмяПоля);
	
	Если НовыйЭлемент = Неопределено Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Родитель);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = ПутьКДанным;
		
		Если ПоместитьПеред <> Неопределено Тогда
			Форма.Элементы.Переместить(НовыйЭлемент, НовыйЭлемент.Родитель, ПоместитьПеред);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовыйЭлемент;
	
КонецФункции

#КонецОбласти
